Rabittitan/base_embedded/application/sources/platform/stm32f/io_cfg.c
/**
 ******************************************************************************
 * @author: GaoKong
 * @date:   05/09/2016
 ******************************************************************************
**/
#include <stdint.h>
#include <stdbool.h>

#include "io_cfg.h"
#include "platform.h"

#include "sys_dbg.h"
#include "sys_ctrl.h"

#include "app_dbg.h"
#include "system.h"

#include "stm32f10x_spi.h"

#include "stm32f10x_flash.h"




//#pragma GCC optimize ("O3")

/******************************************************************************
* button function
*******************************************************************************/
void io_button_mode_init() {
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(BUTTON_MODE_IO_CLOCK, ENABLE);
	GPIO_InitStructure.GPIO_Pin   = BUTTON_MODE_IO_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(BUTTON_MODE_IO_PORT, &GPIO_InitStructure);
}

void io_button_up_init() {
		
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(BUTTON_UP_IO_CLOCK, ENABLE);
	GPIO_InitStructure.GPIO_Pin   = BUTTON_UP_IO_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(BUTTON_UP_IO_PORT, &GPIO_InitStructure);
}

void io_button_down_init() {
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(BUTTON_DOWN_IO_CLOCK, ENABLE);
	GPIO_InitStructure.GPIO_Pin   = BUTTON_DOWN_IO_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(BUTTON_DOWN_IO_PORT, &GPIO_InitStructure);
}

uint8_t io_button_mode_read() {
	return  GPIO_ReadInputDataBit(BUTTON_MODE_IO_PORT,BUTTON_MODE_IO_PIN);
}

uint8_t io_button_up_read() {
	return  GPIO_ReadInputDataBit(BUTTON_UP_IO_PORT,BUTTON_UP_IO_PIN);
}

uint8_t io_button_down_read() {
	return  GPIO_ReadInputDataBit(BUTTON_DOWN_IO_PORT,BUTTON_DOWN_IO_PIN);
}

/******************************************************************************
* led status function
*******************************************************************************/
void led_life_init() {
	GPIO_InitTypeDef        GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(LED_LIFE_IO_CLOCK, ENABLE);

	GPIO_InitStructure.GPIO_Pin = LED_LIFE_IO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	//GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(LED_LIFE_IO_PORT, &GPIO_InitStructure);
}

void led_life_off() {
	GPIO_SetBits(LED_LIFE_IO_PORT, LED_LIFE_IO_PIN);
}

void led_life_on() {
	GPIO_ResetBits(LED_LIFE_IO_PORT, LED_LIFE_IO_PIN);
}

/******************************************************************************
* nfr24l01 IO function
*******************************************************************************/
/******************************************************************************
* flash IO config
*******************************************************************************/
void flash_io_ctrl_init() {
	GPIO_InitTypeDef        GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(FLASH_CE_IO_CLOCK, ENABLE);

	GPIO_InitStructure.GPIO_Pin = FLASH_CE_IO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	
	GPIO_Init(FLASH_CE_IO_PORT, &GPIO_InitStructure);
}

void flash_cs_low() {
	GPIO_ResetBits(FLASH_CE_IO_PORT, FLASH_CE_IO_PIN);
}

void flash_cs_high() {
	GPIO_SetBits(FLASH_CE_IO_PORT, FLASH_CE_IO_PIN);
}

uint8_t flash_transfer(uint8_t data) {
	unsigned long rxtxData = data;
	uint32_t counter;


	/* waiting send idle then send data */
	counter = system_info.cpu_clock / 1000;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET) {
		if (counter-- == 0) {
			FATAL("spi", 0x01);
		}
		// if (--timeout == 0) {
		// 	// Xử lý lỗi ở đây: Reset ngoại vi, log lỗi hoặc trả về mã lỗi
		// 	log_error("SPI Timeout!");
		// 	//return ERROR_TIMEOUT; 
		// }

	}

	SPI_I2S_SendData(SPI1, (uint8_t)rxtxData);

	/* waiting conplete rev data */
	counter = system_info.cpu_clock / 1000;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET) {
		if (counter-- == 0) {
			FATAL("spi", 0x02);
		}
	}

	rxtxData = (uint8_t)SPI_I2S_ReceiveData(SPI1);

	return (uint8_t)rxtxData;
}


/******************************************************************************
* adc function
* + CT sensor
* + themistor sensor
* Note: MUST be enable internal clock for adc module.
*******************************************************************************/
void io_cfg_adc1(void) {
	ADC_InitTypeDef ADC_InitStructure;
	RCC_HSICmd(ENABLE);
	while(RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET);

	/* Enable ADC1 clock */
	RCC_APB2PeriphClockCmd(BAT_ADC_CLOCK , ENABLE);
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_InitStructure.ADC_ContinuousConvMode =DISABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 2;
	ADC_Init(ADC1, &ADC_InitStructure);
	ADC_Cmd(ADC1, ENABLE);
}

void adc_bat_io_cfg() {
	GPIO_InitTypeDef    GPIO_InitStructure;
	RCC_AHBPeriphClockCmd(BAT_ADC_IO_CLOCK, ENABLE);

	GPIO_InitStructure.GPIO_Pin = BAT_ADC_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	
	GPIO_Init(BAT_ADC_PORT, &GPIO_InitStructure);
}

uint16_t adc_bat_io_read(uint8_t channel)
{
    ADC_RegularChannelConfig(ADC1, channel, 1, ADC_SampleTime_7Cycles5);
    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
    return ADC_GetConversionValue(ADC1);
}

uint32_t sys_ctr_get_vbat_voltage() {
#define VREFINT_CAL_ADDR (uint16_t*)(0x1FF80078)
	uint16_t vref_data = 0, vref_cal;
	uint32_t vbatX1000;

	ADC_TempSensorVrefintCmd(ENABLE);
	// ADC_RegularChannelConfig(ADC1, ADC_Channel_Vrefint, 1, ADC_SampleTime_384Cycles);

	// while (ADC_GetFlagStatus(ADC1, ADC_FLAG_ADONS) == RESET);
	// sys_ctrl_delay_ms(10);

	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
	while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);

	vref_data += ADC_GetConversionValue(ADC1);

	vref_cal = *VREFINT_CAL_ADDR;
	vbatX1000 = (uint32_t)(3000.0 * (float)(vref_cal) / (float)vref_data);

	return vbatX1000;
}

uint32_t sys_ctr_get_mcu_temperature() {
	//	• TS_CAL2 is the temperature sensor calibration value acquired at 110°C
	//	• TS_CAL1 is the temperature sensor calibration value acquired at 30°C
	//	• TS_DATA is the actual temperature sensor output value converted by ADC
#define TS_CAL1 (*((uint16_t*)(uint32_t)0x1FF8007A))
#define TS_CAL2 (*((uint16_t*)(uint32_t)0x1FF8007E))

	uint32_t temperature, TS_DATA;

	ADC_TempSensorVrefintCmd(ENABLE);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_TempSensor, 1, ADC_SampleTime_28Cycles5);

	while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
	sys_ctrl_delay_ms(10);

	ADC_SoftwareStartConvCmd(ADC1,ENABLE);
	while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);

	TS_DATA = ADC_GetConversionValue(ADC1);
	temperature = ( 30 * (TS_CAL2 - TS_DATA) + 110 * (TS_DATA - TS_CAL1) ) / (TS_CAL2 - TS_CAL1);

	return temperature;
}

/******************************************************************************
* ssd1306 oled IO function i2c 
*******************************************************************************/

void oled_i2c_io_init() {
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_APB2PeriphClockCmd(OLED_SCL_IO_CLOCK | OLED_SDA_IO_CLOCK, ENABLE);

   
    GPIO_InitStructure.GPIO_Pin = OLED_SCL_IO_PIN | OLED_SDA_IO_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD; 
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(OLED_SCL_IO_PORT, &GPIO_InitStructure);

    
    GPIO_SetBits(OLED_SCL_IO_PORT, OLED_SCL_IO_PIN);
    GPIO_SetBits(OLED_SDA_IO_PORT, OLED_SDA_IO_PIN);
}


/******************************************************************************
* ssd1306 oled IO function
*******************************************************************************/
// void oled_clk_input_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;

// 	RCC_AHBPeriphClockCmd(OLED_CLK_IO_CLOCK, ENABLE);
// 	GPIO_InitStructure.GPIO_Pin = OLED_CLK_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
// 	GPIO_Init(OLED_CLK_IO_PORT, &GPIO_InitStructure);
// }

// void oled_clk_output_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;

// 	RCC_AHBPeriphClockCmd(OLED_CLK_IO_CLOCK, ENABLE);

// 	GPIO_InitStructure.GPIO_Pin = OLED_CLK_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
// 	GPIO_Init(OLED_CLK_IO_PORT, &GPIO_InitStructure);
// }

// void oled_clk_digital_write_low() {
// 	GPIO_ResetBits(OLED_CLK_IO_PORT,OLED_CLK_IO_PIN);
// }

// void oled_clk_digital_write_high() {
// 	GPIO_SetBits(OLED_CLK_IO_PORT,OLED_CLK_IO_PIN);
// }

// int oled_clk_digital_read() {
// 	return (int)(GPIO_ReadInputDataBit(OLED_CLK_IO_PORT, OLED_CLK_IO_PIN));
// }

// void oled_data_input_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;

// 	RCC_AHBPeriphClockCmd(OLED_DATA_IO_CLOCK, ENABLE);
// 	GPIO_InitStructure.GPIO_Pin = OLED_DATA_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
// 	GPIO_Init(OLED_DATA_IO_PORT, &GPIO_InitStructure);
// }

// void oled_data_output_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;
// 	RCC_AHBPeriphClockCmd(OLED_DATA_IO_CLOCK, ENABLE);
// 	GPIO_InitStructure.GPIO_Pin = OLED_DATA_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;

// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	
// 	GPIO_Init(OLED_DATA_IO_PORT, &GPIO_InitStructure);
// }

// void oled_data_digital_write_low() {
// 	GPIO_ResetBits(OLED_DATA_IO_PORT, OLED_DATA_IO_PIN);
// }

// void oled_data_digital_write_high() {
// 	GPIO_SetBits(OLED_DATA_IO_PORT, OLED_DATA_IO_PIN);
// }

// int oled_data_digital_read() {
// 	return (int)(GPIO_ReadInputDataBit(OLED_DATA_IO_PORT, OLED_DATA_IO_PIN));
// }

// /* SH1106 driver */
// void oled_res_input_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;

// 	RCC_AHBPeriphClockCmd(OLED_RES_IO_CLOCK, ENABLE);
// 	GPIO_InitStructure.GPIO_Pin = OLED_RES_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
// 	GPIO_Init(OLED_RES_IO_PORT, &GPIO_InitStructure);
// }

// void oled_res_output_mode() {
// 	GPIO_InitTypeDef    GPIO_InitStructure;
// 	RCC_AHBPeriphClockCmd(OLED_RES_IO_CLOCK, ENABLE);
// 	GPIO_InitStructure.GPIO_Pin = OLED_RES_IO_PIN;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
// 	GPIO_Init(OLED_RES_IO_PORT, &GPIO_InitStructure);
// }

// void oled_res_digital_write_low() {
// 	GPIO_ResetBits(OLED_RES_IO_PORT, OLED_RES_IO_PIN);
// }

// void oled_res_digital_write_high() {
// 	GPIO_SetBits(OLED_RES_IO_PORT, OLED_RES_IO_PIN);
// }

// int oled_res_digital_read() {
// 	return (int)(GPIO_ReadInputDataBit(OLED_RES_IO_PORT, OLED_RES_IO_PIN));
// }






void internal_flash_unlock() {
	FLASH_Unlock();
	FLASH_ClearFlag(FLASH_FLAG_EOP| FLASH_FLAG_WRPRTERR| FLASH_FLAG_PGERR
							| FLASH_FLAG_BSY | FLASH_FLAG_OPTERR);
}

void internal_flash_lock() {
	FLASH_Lock();
}

void internal_flash_erase_pages_cal(uint32_t address, uint32_t len) {
	uint32_t page_number;
	uint32_t index;

	page_number = len / 256;

	if ((page_number * 256) < len) {
		page_number++;
	}

	for (index = 0; index < page_number; index++) {
		FLASH_ErasePage(address + (index * 256));
	}
}

uint8_t internal_flash_write_cal(uint32_t address, uint8_t* data, uint32_t len) {
	uint32_t temp;
	uint32_t index = 0;
	FLASH_Status flash_status = FLASH_BUSY;

	while (index < len) {
		temp = 0;

		memcpy(&temp, &data[index], (len - index) >= sizeof(uint32_t) ? sizeof(uint32_t) : (len - index));

		flash_status = FLASH_ProgramWord(address + index, temp);

		if(flash_status == FLASH_COMPLETE) {
			index += sizeof(uint32_t);
		}
		else {
			FLASH_ClearFlag(FLASH_FLAG_EOP| FLASH_FLAG_WRPRTERR| FLASH_FLAG_PGERR
							| FLASH_FLAG_BSY | FLASH_FLAG_OPTERR);
		}
	}

	return 1;
}

void io_uart2_cfg() {
	USART_InitTypeDef USART_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	/* Enable GPIO clock */
	RCC_APB2PeriphClockCmd(USART2_TX_GPIO_CLK | USART2_RX_GPIO_CLK, ENABLE);

	/* Enable USART clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	/* Connect PXx to USART2_Tx */
	//GPIO_PinAFConfig(USART2_TX_GPIO_PORT, USART2_TX_SOURCE, USART2_TX_AF);

	/* Connect PXx to USART2_Rx */
	//GPIO_PinAFConfig(USART2_RX_GPIO_PORT, USART2_RX_SOURCE, USART2_RX_AF);

	/* Configure USART Tx and Rx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Pin = USART2_TX_PIN;
	GPIO_Init(USART2_TX_GPIO_PORT, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = USART2_RX_PIN;
	GPIO_Init(USART2_RX_GPIO_PORT, &GPIO_InitStructure);

	/* USART2 configuration */
	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART2, &USART_InitStructure);

	/* Enable the USART2 Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = IRQ_PRIO_UART2_IO;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	USART_ClearITPendingBit(USART2, USART_IT_RXNE | USART_IT_TXE);
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	USART_ITConfig(USART2, USART_IT_TXE, DISABLE);

	/* Enable USART */
	USART_Cmd(USART2, ENABLE);
}

void io_uart2_putc(uint8_t c) {
	/* wait last transmission completed */
	while (USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);

	/* put transnission data */
	USART_SendData(USART2, (uint8_t)c);

	/* wait transmission completed */
	while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
}

uint8_t io_uart2_getc() {
	uint8_t c = 0;
	while (USART_GetITStatus(USART2, USART_IT_RXNE) == SET) {
		USART_ClearITPendingBit(USART2, USART_IT_RXNE);
		c = (uint8_t)USART_ReceiveData(USART2);
	}
	return c;
}

/*****************************************************************************
 *io uart for rs485
******************************************************************************/
void io_uart_rs485_cfg() {
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	/* Enable GPIO clock */
	RCC_AHBPeriphClockCmd(USART_RS485_TX_GPIO_CLK | USART_RS485_RX_GPIO_CLK, ENABLE);

	/* Enable USART clock */
	RCC_APB1PeriphClockCmd(USART_RS485_CLK, ENABLE);

	/* Connect PXx to USART2_Tx */
	//GPIO_PinAFConfig(USART2_TX_GPIO_PORT, USART2_TX_SOURCE, USART2_TX_AF);

	/* Connect PXx to USART2_Rx */
	//GPIO_PinAFConfig(USART2_RX_GPIO_PORT, USART2_RX_SOURCE, USART2_RX_AF);

	/* Configure USART Tx and Rx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_2MHz;
	
	GPIO_InitStructure.GPIO_Pin		= USART_RS485_TX_PIN;
	GPIO_Init(USART_RS485_TX_GPIO_PORT, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin		= USART_RS485_RX_PIN;
	GPIO_Init(USART_RS485_RX_GPIO_PORT, &GPIO_InitStructure);

	/* NVIC configuration */
	/* Configure the Priority Group to 4 bits */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	NVIC_InitStructure.NVIC_IRQChannel = USART_RS485_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* see more in mbportserial.c */
}

void io_rs485_dir_mode_output() {
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(RS485_DIR_IO_CLOCK, ENABLE);
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_Out_PP;

	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Pin		= RS485_DIR_IO_PIN;
	GPIO_Init(RS485_DIR_IO_PORT, &GPIO_InitStructure);
}

void io_rs485_dir_low() {
	GPIO_ResetBits(RS485_DIR_IO_PORT, RS485_DIR_IO_PIN);
}

void io_rs485_dir_high() {
	GPIO_SetBits(RS485_DIR_IO_PORT, RS485_DIR_IO_PIN);
}
